In [1]:
import numpy as np 
import pandas as pd

In [2]:
ser_1 = pd.Series(data= [10,11,12,13,14], index= ['a','b','c','d','e'])
ser_1

a    10
b    11
c    12
d    13
e    14
dtype: int64

In [3]:
ser_1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [4]:
ser_1.values

array([10, 11, 12, 13, 14])

In [5]:
ser_1[ser_1> 12]

d    13
e    14
dtype: int64

In [6]:
arr_1 = np.array([[1,6,11,16,21],[2,7,12,17,22],[3,8,13,18,23],[4,9,14,19,24],
                  [5,10,15,20,25]])
df_1 = pd.DataFrame(data=arr_1, index=['row1','row2','row3','row4','row5'],
                   columns=['col1','col2','col3','col4','col5'])
df_1

      col1  col2  col3  col4  col5
row1     1     6    11    16    21
row2     2     7    12    17    22
row3     3     8    13    18    23
row4     4     9    14    19    24
row5     5    10    15    20    25

In [7]:
dic_1 = {'col1':[1,2,3,4], 'col2':[5,6,7,8], 'col3':[9,10,11,12], 'col4':[13,14,15,16]}
df_12 = pd.DataFrame(data=dic_1, index= ['row1', 'row2', 'row3', 'row4'], 
                     columns= ['col1', 'col2', 'col3', 'col4'] )
df_12

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [8]:
df_1.index

Index(['row1', 'row2', 'row3', 'row4', 'row5'], dtype='object')

In [8]:
df_1.columns

Index(['col1', 'col2', 'col3', 'col4', 'col5'], dtype='object')

In [10]:
df_1.values

array([[ 1,  6, 11, 16, 21],
       [ 2,  7, 12, 17, 22],
       [ 3,  8, 13, 18, 23],
       [ 4,  9, 14, 19, 24],
       [ 5, 10, 15, 20, 25]])

In [11]:
df_1.loc['row1']['col1':'col3']

col1     1
col2     6
col3    11
Name: row1, dtype: int64

In [12]:
df_1.iloc[3][:]

col1     4
col2     9
col3    14
col4    19
col5    24
Name: row4, dtype: int64

In [13]:
df_1['col6'] = [26,27,28,29,30]
df_1

      col1  col2  col3  col4  col5  col6
row1     1     6    11    16    21    26
row2     2     7    12    17    22    27
row3     3     8    13    18    23    28
row4     4     9    14    19    24    29
row5     5    10    15    20    25    30

In [14]:
df_1.loc['row1', 'col1'] = 0
df_1.loc['row2', 'col2'] = 0
df_1

      col1  col2  col3  col4  col5  col6
row1     0     6    11    16    21    26
row2     2     0    12    17    22    27
row3     3     8    13    18    23    28
row4     4     9    14    19    24    29
row5     5    10    15    20    25    30

In [16]:
df_12 = df_12.reset_index(drop= True)

In [17]:
df_12

   col1  col2  col3  col4
0     1     5     9    13
1     2     6    10    14
2     3     7    11    15
3     4     8    12    16

In [19]:
df_12 = df_12.drop('col4', axis= 1)

In [20]:
df_12

   col1  col2  col3
0     1     5     9
1     2     6    10
2     3     7    11
3     4     8    12

In [21]:
df_12.rename(columns={'col3':'column3'}, inplace= True)
df_12

   col1  col2  column3
0     1     5        9
1     2     6       10
2     3     7       11
3     4     8       12

In [30]:
df_12.iloc[0]['col1'] = 0
df_12.iloc[1]['col2'] = 0
df_12

   col1  col2  column3
0   0.0   5.0      9.0
1   2.0   0.0     10.0
2   3.0   7.0     11.0
3   4.0   8.0     12.0

In [23]:
df_12.replace({0:np.NaN}, inplace= True)
df_12

   col1  col2  column3
0     1     5        9
1     2     6       10
2     3     7       11
3     4     8       12

In [29]:
df_1.replace({0:np.NAN}, inplace= True)
df_1

      col1  col2  col3  col4  col5  col6
row1   NaN   6.0  11.0  16.0  21.0  26.0
row2   2.0   NaN  12.0  17.0  22.0  27.0
row3   3.0   8.0  13.0  18.0  23.0  28.0
row4   4.0   9.0  14.0  19.0  24.0  29.0
row5   5.0  10.0  15.0  20.0  25.0  30.0

# Insert a Function

In [30]:
df_1.col1 = [ '{:.2f}'.format(x)  for x in df_1.iloc[:,0]]
df_1

      col1  col2  col3  col4  col5  col6
row1   nan   6.0  11.0  16.0  21.0  26.0
row2  2.00   NaN  12.0  17.0  22.0  27.0
row3  3.00   8.0  13.0  18.0  23.0  28.0
row4  4.00   9.0  14.0  19.0  24.0  29.0
row5  5.00  10.0  15.0  20.0  25.0  30.0

In [31]:
df_1['col2'] = df_1['col2'].apply(lambda x: '{:.2f}'.format(x))
df_1

      col1   col2  col3  col4  col5  col6
row1   nan   6.00  11.0  16.0  21.0  26.0
row2  2.00    nan  12.0  17.0  22.0  27.0
row3  3.00   8.00  13.0  18.0  23.0  28.0
row4  4.00   9.00  14.0  19.0  24.0  29.0
row5  5.00  10.00  15.0  20.0  25.0  30.0

 # Sorting

In [35]:
df_1.sort_index(axis= 1, ascending= False, inplace= True)
df_1

      col6  col5  col4  col3   col2  col1
row1  26.0  21.0  16.0  11.0   6.00   nan
row2  27.0  22.0  17.0  12.0    nan  2.00
row3  28.0  23.0  18.0  13.0   8.00  3.00
row4  29.0  24.0  19.0  14.0   9.00  4.00
row5  30.0  25.0  20.0  15.0  10.00  5.00

In [36]:
df_1.sort_values(by= 'col6', ascending= False, inplace= True)
df_1

      col6  col5  col4  col3   col2  col1
row5  30.0  25.0  20.0  15.0  10.00  5.00
row4  29.0  24.0  19.0  14.0   9.00  4.00
row3  28.0  23.0  18.0  13.0   8.00  3.00
row2  27.0  22.0  17.0  12.0    nan  2.00
row1  26.0  21.0  16.0  11.0   6.00   nan

# Methods()

In [38]:
df_1.head(2)

      col6  col5  col4  col3   col2  col1
row5  30.0  25.0  20.0  15.0  10.00  5.00
row4  29.0  24.0  19.0  14.0   9.00  4.00

In [39]:
df_1.tail(3)

      col6  col5  col4  col3  col2  col1
row3  28.0  23.0  18.0  13.0  8.00  3.00
row2  27.0  22.0  17.0  12.0   nan  2.00
row1  26.0  21.0  16.0  11.0  6.00   nan

In [40]:
data = pd.read_csv('smartphones.csv')

In [41]:
data

        Name        OS  Capacity  Ram  Weight    Company  inch
0  Galaxy S8   Android        64    4   149.0    Samsung   5.8
1  Lumia 950  windows         32    3   150.0  Microsoft   5.2
2  Xpreia L1   Android        16    2   180.0       Sony   5.5
3  iphone 7        ios       128    2   138.0      Apple   4.7
4    U Ultra   Android        64    4   170.0        HTC   5.7
5  Galaxy S5   Android        16    2   145.0    Samsung   5.1
6  iphone 5s       ios        32    1   112.0      Apple   4.0
7    Moto G5   Android        16    3   144.5   Motorola   5.0
8     Pixel    Android       128    4   143.0     Google   5.0